:PROPERTIES:
:ID:       a047ed53-7758-4ecd-8451-1eaf172442eb
:END:
#+title: 编译期优化
#+filetags: cpp

* 编译期优化
- 编译期优化 :: 编译器对 *变量/表达式* 运行时计算 提前到 编译时计算（好处：提高运行时候效率，坏处：不好 debug）3种优化方式:
  + 常量折叠 :: 将常量 *表达式* （3 + 7）替换为结果（10）
  + 常量传播 :: 已知常量值的 *变量* 替换为结果（x 替换为7）
  + 死代码消除 :: 移除未使用的代码（没有使用的变量定义）
#+begin_src cpp :results output :namespaces std :includes <iostream>
int x { 7 };
int y { 3 };
int z { 10 };
cout << x + y << '\n';

// NOTE 该示例 可能 在编译期进行了以下操作
// 常量传播   -> 将 x 和 y 替换为 7 和 3
// 常量折叠   -> 将 7 + 3 替换为 10 （如果不进行替换，则每次运行时就会重复计算 7 + 3，运行 100 次就计算 100 次）
// 死代码消除 -> 移除 int z { 10 }; 这行代码，因为它没被使用
#+end_src

#+RESULTS:
: 10



